Tekla Open API Reference for Tekla Structures 2025
Reinforcement.GetRebarGeometries Method (Reinforcement.RebarGeometryOptionEnum)
 Retrieves a list of physical reinforcing bars (of type RebarGeometry). These objects contain physical points in the 3D space of each reinforcing bar.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetRebarGeometries(
	Reinforcement.RebarGeometryOptionEnum options
)
Public Function GetRebarGeometries (
	options As Reinforcement.RebarGeometryOptionEnum
) As ArrayList
Parameters
options
Type: Tekla.Structures.Model.Reinforcement.RebarGeometryOptionEnum
The options.
Return Value
Type: ArrayList
An array list that contains the RebarGeometry objects.
See Also
Reference
Reinforcement Class
GetRebarGeometries Overload
Tekla.Structures.Model Namespace